{
  "meta": {
    "theme": "actual"
  },
  "basics": {
    "firstName" : "Pikachu", 
    "name": "Pruthviraj Mundargi",
    "label": "MS in Data Science Graduate",
    "image": "https://avatars.githubusercontent.com/u/137219152?v=4",
    "summary": "I am a passionate Data Scientist with a strong focus on machine learning, data analysis, and cutting-edge research. My hands-on experience with building and fine-tuning machine learning models in Python, alongside my proficiency in SQL and visualization tools like Power BI and Tableau, has allowed me to turn complex datasets into impactful insights. Currently, I am honing my skills as a Data Analyst Intern at Pinnacle Healthcare Staffing, where I am eager to learn and contribute more, but my ultimate goal is to pursue a career as a Data Scientist.I thrive in environments that foster growth, and my time as a Graduate Teaching Assistant at Drexel University gave me the opportunity to deepen my knowledge, support students, and further my understanding of core data science principles. With a strong passion for research and continuous learning, I am always exploring new tools, techniques, and methodologies to stay at the forefront of the field. I am actively seeking opportunities that allow me to grow, contribute, and ultimately drive innovation in data science.",
    "summarytr": "Veri analizi, makine öğrenimi ve yazılım geliştirme konusunda sağlam bir temele sahip bir Veri Bilimcisiyim. Uzmanlığım Python, SQL ve Power BI ve Tableau gibi çeşitli veri görselleştirme araçlarını kapsar. Veri hatları oluşturma, veri analizi yapma ve makine öğrenimi modelleri oluşturma konusunda uygulamalı deneyimim var. Karmaşık verileri eyleme dönüştürülebilir içgörülere dönüştürme konusunda tutkuluyum ve alanda önde kalmak için sürekli olarak yeni araçlar ve teknolojiler öğreniyorum.",
    "website": "#",
    "email": "anamika.rekhar@gmail.com",
    "location": {
      "city": "Cheltenham",
      "countryCode": "US"
    },
    "profiles": {
      "twitter": {
        "username": "",
        "url": "https://twitter.com/"
      },
      "github": {
        "url": "https://github.com/AnamikaRekha1999",
        "username": "AnamikaRekha1999"
      },
      "linkedin": {
        "username": "anamikarekha",
        "url": "https://www.linkedin.com/in/anamikarekha"
      }
    }
  },
  "ProjectExperience": [
    {
      "name": "Movie Recommendation System",
      "explanation": "Led a comprehensive data cleaning process on datasets from MovieLens, IMDB, Rotten Tomatoes, and Wikipedia, processing over 20 million records to handle missing values, eliminate duplicates, and standardize formats. Conducted exploratory data analysis on over 100 movie attributes and user preferences to identify key patterns for algorithm development. Built and optimized collaborative filtering models including Singular Value Decomposition (SVD), SVD++, and Non-Negative Matrix Factorization (NMF) for predicting user ratings. Evaluated model performance using metrics like Root Mean Squared Error (RMSE) and Mean Absolute Error (MAE). Developed a Content-Based recommendation system using Cosine Similarity, Jaccard Similarity, and k-nearest neighbors (KNN) for personalized recommendations.",
      "tag": [
        "Python",
        "Pandas",
        "SciPy",
        "Machine Learning"
      ],
      "bestLang": "Python",
      "date": "Sep 2023 – Mar 2024",
      "link": "https://github.com/AnamikaRekha1999/movie-recommendation-system",
      "viewLink": ""
    },
    {
      "name": "Suicide Data Acquisition and Analysis",
      "explanation": "Conducted web scraping in Python to acquire a comprehensive suicide dataset from various websites, adding valuable data points. Preprocessed and manipulated the data, merging it with other datasets to ensure accuracy and consistency. Provided actionable insights for suicide prevention agencies to enhance outreach efforts.",
      "tag": [
        "Python",
        "Web Scraping",
        "Data Analysis"
      ],
      "bestLang": "Python",
      "date": "Sep 2022 – Dec 2022",
      "link": "https://github.com/AnamikaRekha1999/suicide-data-analysis",
      "viewLink": ""
    }
  ],
  "education": [
    {
      "endDate": "2024",
      "startDate": "2022",
      "area": "Data Science",
      "studyType": "Master of Science",
      "institution": "Drexel University, Philadelphia, PA",
      "gpa": "3.93"
    },
    {
      "endDate": "2021",
      "startDate": "2017",
      "area": "Computer Science and Engineering",
      "studyType": "Bachelor of Technology (Honors)",
      "institution": "APJ Abdul Kalam Technological University, Kerala, India",
      "gpa": "3.78"
    }
  ],
  "references": [
    {
      "reference": "",
      "name": ""
    },
    {
      "reference": "",
      "name": ""
    },
    {
      "reference": "",
      "name": ""
    },
    {
      "reference": "",
      "name": ""
    }
  ],
  "skills": [
    {
      "keywords": [
        "Python",
        "SQL",
        "C",
        "R",
        "HTML",
        "CSS"
      ],
      "level": "Professional",
      "name": "Data Science",
      "situation": "Programming Languages"
    },
    {
      "keywords": [
        "Tableau"
      ],
      "level": "Intermediate",
      "name": "Data Science",
      "situation": "Tools & Technologies"
    },
    {
      "keywords": [
        "Tableau",
        "Machine Learning Concepts"
      ],
      "level": "Intermediate",
      "name": "Data Science",
      "situation": "Methodologies"
    },
    {
      "keywords": [
        "Git",
        "Linux",
        "Windows"
      ],
      "level": "Intermediate",
      "name": "Data Science",
      "situation": "Environment/OS"
    }
  ],
  "awards": [
    {
      "title": "",
      "awarder": ""
    }
  ],
  "work": [
    {
      "summary": "Pinnacle Healthcare Staffing provides specialized services in healthcare staffing and data analysis.",
      "name": "Pinnacle Healthcare Staffing",
      "location": "Philadelphia, PA",
      "position": "Data Analyst Intern",
      "startDate": "Sep 2024",
      "endDate": "Prsent",
      "highlights": [
        "Utilized data collection and cleansing techniques to prepare datasets for analysis",
        "Managed and queried databases to extract relevant information for reports",
        "Assisted in research methodologies and report writing to support healthcare staffing strategies"
      ]
    },
    {
      "summary": "Cognizant Technology Solutions is a global technology and professional services company that helps clients build and modernize technology systems.",
      "name": "Cognizant Technology Solutions",
      "location": "Banglore, India",
      "position": "Programmer Analyst",
      "startDate": "Aug 2021",
      "endDate": "Sep 2022",
      "highlights": [
        "Analyzed production issues, reviewed test scripts, and provided bug fixes to ensure smooth project deployment",
        "Participated in CR processes, managed Azure boards, and collaborated with stakeholders during sprints, demos, and unit tests"
      ]
    }
  ],
  "interests": [
    "Drawing",
    "Risk game"
  ],
  "Relevant_Coursework": [
    "Data Structures and Algorithms I",
    "Data Structures and Algorithms II",
    "Applied Machine Learning for Data Science"
  ]
}